emacs/.emacs.d/init.org
#+title: My Literate Emacs Config
#+options: toc:nil num:t

* Early Init

#+begin_src emacs-lisp :tangle "early-init.el"

;;; -*- lexical-binding: t; -*-

(when (eq system-type 'darwin)

  (setq mac-command-modifier       'control
        mac-option-modifier        'meta
        mac-control-modifier       'hyper
        mac-right-command-modifier 'control
        mac-right-option-modifier  'meta)

  (setq insert-directory-program "/opt/homebrew/bin/gls"
        dired-use-ls-dired t)

  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

#+end_src


* Prerequisites

#+begin_src emacs-lisp :tangle "init.el"

;;; -*- lexical-binding: t; -*-

(setq user-full-name "MarkieAurelius"
      user-mail-address "MarkieAurelius@gmail.com")

(setq custom-file (locate-user-emacs-file "custom.el"))
(load custom-file :no-error-if-file-is-missing)

(add-to-list 'load-path (locate-user-emacs-file "prot-lisp"))

#+end_src

* Package Management

#+begin_src emacs-lisp :tangle "init.el"

(require 'package)
(package-initialize)

(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))

#+end_src

* Essentials

#+begin_src emacs-lisp :tangle "init.el"

    (setq make-backup-files nil)
    (setq create-lockfiles nil)
    (setq use-short-answers t)
    (setq confirm-kill-emacs 'yes-or-no-p)
    (setq initial-major-mode 'lisp-interaction-mode
        initial-scratch-message ""
        initial-buffer-choice t)

    (save-place-mode 1)

  (setq visible-bell nil)
  (setq ring-bell-function 'ignore)
  (setq scroll-margin 6)

  (setq ispell-alternate-dictionary "/usr/share/dict/words")

  #+end_src

** Native Comp
#+begin_src emacs-lisp :tangle "init.el"

(when (native-comp-available-p)
  (setq native-comp-async-report-warnings-errors 'silent)
  (setq native-compile-prune-cache t))

#+end_src


** Frame

#+begin_src emacs-lisp :tangle "init.el"

(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize 'force
      frame-title-format '("%b")
      ring-bell-function 'ignore
      use-dialog-box t
      use-file-dialog nil
      use-short-answers t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name
      inhibit-startup-buffer-menu t)

#+end_src

** Recentf

#+begin_src emacs-lisp :tangle "init.el"

  (use-package recentf
    :ensure nil
    :hook (after-init . recentf-mode)
    :config
    (setq recentf-max-saved-items 100)
    (setq recentf-max-menu-items 25)
    (setq recentf-save-file-modes nil)
    (setq recentf-keep nil)
    (setq recentf-auto-cleanup nil)
    (setq recentf-initialize-file-name-history nil)
    (setq recentf-filename-handlers nil)
    (setq recentf-show-file-shortcuts-flag nil))

#+end_src

** Bookmarks

#+begin_src emacs-lisp :tangle "init.el"

  (use-package bookmark
  :ensure nil
  :commands (bookmark-set bookmark-jump bookmark-bmenu-list)
  :hook (bookmark-bmenu-mode . hl-line-mode)
  :config
  (setq bookmark-use-annotations nil)
  (setq bookmark-automatically-show-annotations nil)
  (setq bookmark-fringe-mark nil)
  (setq bookmark-save-flag 1))

#+end_src

** Delsel

#+begin_src emacs-lisp :tangle "init.el"

(use-package delsel
  :ensure nil
  :hook (after-init . delete-selection-mode))

#+end_src

** Emacs Changes

#+begin_src emacs-lisp :tangle "init.el"

  (use-package emacs
    :ensure nil
    :demand t
    :config
    (setq blink-matching-paren nil)
    (setq custom-unlispify-tag-names nil)
    (setq delete-pair-blink-delay 0.1)
    (setq delete-pair-push-mark t)
    (setq echo-keystrokes-help nil)
    (setq epa-keys-select-method 'minibuffer)
    (setq eval-expression-print-length nil)
    (setq find-library-include-other-files nil)
    (setq help-window-select t)
    (setq kill-do-not-save-duplicates t)
    (setq mode-require-final-newline 'visit-save)
    (setq next-error-recenter '(4))
    (setq remote-file-name-inhibit-auto-save t)
    (setq remote-file-name-inhibit-delete-by-moving-to-trash t)
    (setq save-interprogram-paste-before-kill t)
    (setq scroll-error-top-bottom t)
    (setq tramp-connection-timeout (* 60 10))
    (setq-default truncate-partial-width-windows nil)
    (setq tab-first-completion 'word-or-paren-or-punct)
    (setq-default tab-width 4
                indent-tabs-mode nil)
    :bind
    ( :map global-map
      ("<f2>" . toggle-input-method)
      ("<insert>" . nil)
      ("<menu>" . nil)
      ("C-x C-d" . nil)
      ("C-x C-v" . nil)
      ("C-z" . nil)
      ("C-x C-z" . nil)
      ("C-x C-c" . nil)
      ("C-x C-c C-c" . save-buffers-kill-emacs)
      ("C-x C-r" . restart-emacs)
      ("C-h h" . nil)
      ("M-`" . nil)
      ("M-o" . delete-blank-lines)
      ("M-SPC" . cycle-spacing)
      ("M-z" . zap-up-to-char)
      ("M-c" . capitalize-dwim)
      ("M-l" . downcase-dwim)
      ("M-u" . upcase-dwim)
      ("M-=" . count-words)
      ("C-x O" . next-multiframe-window)
      ("C-h K" . describe-keymap)
      ("C-x k" . kill-current-buffer)
      ("C-x K" . kill-buffer)
      ("C-c s" . scratch-buffer)

      :map ctl-x-x-map
      ("f" . follow-mode)
      ("r" . rename-uniquely)
      ("l" . visual-line-mode)
      ("v" . variable-pitch-mode)))

#+end_src

** Activate and Disable a Few Commands

#+begin_src emacs-lisp :tangle "init.el"

(mapc
 (lambda (command)
   (put command 'disabled nil))
 '(list-timers narrow-to-region narrow-to-page upcase-region downcase-region))

;; And disable these
(mapc
 (lambda (command)
   (put command 'disabled t))
 '(eshell project-eshell overwrite-mode iconify-frame diary))

#+end_src

** Winner

#+begin_src emacs-lisp :tangle "init.el"

(use-package winner
  :ensure nil
  :hook (after-init . winner-mode)
  :bind
  (("C-x <right>" . winner-redo)
   ("C-x <left>" . winner-undo)))

#+end_src

** Prot-simple

#+begin_src emacs-lisp :tangle "init.el"

(use-package prot-simple
  :ensure nil
  :demand t
  :config
  (setq prot-simple-date-specifier "%F")
  (setq prot-simple-time-specifier "%R %z")

  (advice-add #'save-buffers-kill-emacs :before #'prot-simple-display-unsaved-buffers-on-exit)

  (prot-simple-override-mode 1)

  :bind
  ( :map prot-simple-override-mode-map
    ("C-d" . prot-simple-delete-line)

    ("C-v" . prot-simple-multi-line-below)
    ("<next>" . prot-simple-multi-line-below)
    ("M-v" . prot-simple-multi-line-above)
    ("<prior>" . prot-simple-multi-line-above)

    :map global-map
    ("<escape>" . prot-simple-keyboard-quit-dwim)
    ("C-g" . prot-simple-keyboard-quit-dwim)
    ("C-M-SPC" . prot-simple-mark-sexp)
    ("C-," . prot-simple-mark-sexp)
    ;; Commands for lines
    ("C-S-d" . prot-simple-delete-line-backward)
    ("C-S-k" . prot-simple-kill-line-backward)
    ("M-k" . prot-simple-copy-line-forward)
    ("M-K" . prot-simple-copy-line-backward)
    ("M-j" . delete-indentation)
    ("C-w" . prot-simple-kill-region)
    ("M-w" . prot-simple-kill-ring-save)

    ("C-S-w" . prot-simple-copy-line)
    ("C-S-y" . prot-simple-yank-replace-line-or-region)
    ("<C-return>" . prot-simple-new-line-below)
    ("<C-S-return>" . prot-simple-new-line-above)
    ("C-x x a" . prot-simple-auto-fill-visual-line-mode) ; auto-fill/visual-line toggle
    ;; Commands for text insertion or manipulation
    ("C-=" . prot-simple-insert-date)
    ("C-<" . prot-simple-escape-url-dwim)
    ;; "C->" prot-simple-insert-line-prefix-dwim
    ("M-Z" . prot-simple-zap-to-char-backward)
    ;; Commands for object transposition
    ("C-S-p" . prot-simple-move-above-dwim)
    ("C-S-n" . prot-simple-move-below-dwim)
    ("C-t" . prot-simple-transpose-chars)
    ("C-x C-t" . prot-simple-transpose-lines)
    ("C-S-t" . prot-simple-transpose-paragraphs)
    ("C-x M-t" . prot-simple-transpose-sentences)
    ("C-M-t" . prot-simple-transpose-sexps)
    ("M-t" . prot-simple-transpose-words)
    ;; Commands for paragraphs
    ("M-Q" . prot-simple-unfill-region-or-paragraph)
    ;; Commands for windows and pages
    ("C-x o" . prot-simple-other-window)
    ("C-x n k" . prot-simple-delete-page-delimiters)
    ("M-r" . window-layout-transpose)
    ("M-S-r" . rotate-windows-back)
    ;; Commands for buffers
    ("<C-f2>" . prot-simple-rename-file-and-buffer)
    ("C-x k" . prot-simple-kill-buffer-current)
    ("C-x K" . kill-buffer)
    ("M-s b" . prot-simple-buffers-major-mode)
    ("M-s v" . prot-simple-buffers-vc-root)
    ;; Commands for files
    ("C-x r ." . prot-simple-file-to-register)))

#+end_src

** Auto Revert

#+begin_src emacs-lisp

(use-package autorevert
  :ensure nil
  :hook (after-init . global-auto-revert-mode)
  :config
  (setq auto-revert-verbose t))

#+end_src

* Appearance

** Basics

#+begin_src emacs-lisp :tangle "init.el"

  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)

#+end_src

