emacs/.emacs.d/init.el

  (use-package dired
    :ensure nil
    :commands (dired)
    :config
    (setq dired-kill-when-opening-new-dired-buffer t)
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq delete-by-moving-to-trash t)
    (setq dired-dwim-target t)
    (setq dired-auto-revert-buffer #'dired-directory-changed-p)
    (setq dired-make-directory-clickable t)
    (setq dired-free-space nil)
    (setq dired-mouse-drag-files t)
    
    (define-key dired-jump-map (kbd "j") nil)
    ;; (define-key dired-mode-map (kbd "e") #'wdired-change-to-wdired-mode) (Disabled for evil mode)
    ;; (define-key dired-mode-map (kbd "b") #'dired-up-directory) (Disabled for evil mode)
    (setq dired-listing-switches
        "-AGFhlv --group-directories-first --time-style=long-iso")

    (add-hook 'dired-mode-hook #'dired-hide-details-mode)
    (add-hook 'dired-mode-hook #'hl-line-mode))


  (use-package dired-subtree
    :ensure t
    :after dired
    :bind
    ( :map dired-mode-map
      ("<tab>" . dired-subtree-toggle)
      ("TAB" . dired-subtree-toggle)
      ("<backtab>" . dired-subtree-remove)
      ("S-TAB" . dired-subtree-remove))
    :config
    (setq dired-subtree-use-backgrounds nil))

(use-package wdired
  :ensure nil
  :commands (wdired-change-to-wdired-mode)
  :config
  (setq wdired-allow-to-change-permissions t)
  (setq wdired-create-parent-directories t))

  (use-package magit
  :ensure t
  :bind
  ( :map global-map
    ("C-c g" . magit-status)
    :map magit-mode-map
    ("C-w" . nil)
    ("M-w" . nil))
  :init
  (setq magit-define-global-key-bindings nil))

(use-package forge
  :ensure t
  :after magit)

(use-package project
  :ensure nil
  :bind
  (("C-x p ." . project-dired)
   ("C-x p C-g" . keyboard-quit)
   ("C-x p <return>" . project-dired)
   ("C-x p <delete>" . project-forget-project)))

(use-package calendar
  :ensure nil
  :commands (calendar)
  :config
  (setq calendar-mark-diary-entries-flag nil)
  (setq calendar-mark-holidays-flag t)
  (setq calendar-mode-line-format nil)
  (setq calendar-time-display-form
        '( 24-hours ":" minutes
           (when time-zone (format "(%s)" time-zone))))
  (setq calendar-week-start-day 1)
  (setq calendar-date-style 'iso)
  (setq calendar-time-zone-style 'numeric))

      (use-package org
        :ensure nil
        :init
        (setq org-tags-column 0)
        (setq org-tag-alist nil)
        (setq org-auto-align-tags nil)
        (setq org-directory (expand-file-name "~/projects/private/orgs"))
        (setq org-imenu-depth 7)
      :bind
      ( :map global-map
        ("C-c l" . org-store-link)
        ("C-c o" . org-open-at-point-global)
        :map org-mode-map
        ("C-a" . nil)
        ("C-d" . nil)
        ("C-S-d" . nil)
        ("C-'" . nil)
        ("C-," . nil)
        ("M-;" . nil)
        ("<C-return>" . nil)
        ("<C-S-return>" . nil)
        ("C-M-S-<right>" . nil)
        ("C-M-S-<left>" . nil)
        ("C-c ;" . nil)
        ("C-c M-l" . org-insert-last-stored-link)
        ("C-c C-M-l" . org-toggle-link-display)
        ("M-." . org-edit-special)
        :map org-src-mode-map
        ("M-," . org-edit-src-exit)
        :map narrow-map
        ("b" . org-narrow-to-block)
        ("e" . org-narrow-to-element)
        ("s" . org-narrow-to-subtree))
      :config
      (setq org-ellipsis "⮧")
      (setq org-special-ctrl-a/e nil)
      (setq org-special-ctrl-k nil)
      (setq org-M-RET-may-split-line '((default . nil)))
      (setq org-hide-emphasis-markers nil)
      (setq org-hide-macro-markers nil)
      (setq org-hide-leading-stars nil)
      (setq org-cycle-separator-lines 0)
      (setq org-fold-catch-invisible-edits 'show)
      (setq org-return-follows-link nil)
      (setq org-loop-over-headlines-in-active-region 'start-level)
      (setq org-fontify-quote-and-verse-blocks t)
      (setq org-fontify-whole-block-delimiter-line t)
      (setq org-track-ordered-property-with-tag t)
      (setq org-highest-priority ?A)
      (setq org-lowest-priority ?C)
      (setq org-default-priority ?A)
      (setq org-priority-faces nil)
      (setq org-adapt-indentation nil)
      (setq org-indent-mode-turns-on-hiding-stars nil)
      (setq org-indent-indentation-per-level 4)

  (setq org-refile-targets
        '((org-agenda-files . (:maxlevel . 2))
          (nil . (:maxlevel . 2))))
  (setq org-refile-use-outline-path t)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (setq org-refile-use-cache t)
  (setq org-reverse-note-order nil)

  (setq org-todo-keywords
        '((sequence "TODO(t)" "MAYBE(m)" "|" "CANCELLED(c@)" "DONE(d!)")))

  (setq org-use-fast-todo-selection 'expert)

  (setq org-fontify-done-headline nil)
  (setq org-fontify-todo-headline nil)
  (setq org-fontify-whole-heading-line nil)
  (setq org-enforce-todo-dependencies t)
  (setq org-enforce-todo-checkbox-dependencies t)

  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-log-note-clock-out nil)
  (setq org-log-redeadline 'time)
  (setq org-log-reschedule 'time)
  (setq org-return-follows-link t)
  (setq org-link-context-for-files t)
  (setq org-link-keep-stored-after-insertion nil)
  (setq org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id))

(use-package org-capture
  :ensure nil
  :bind ("C-c c" . org-capture)
  :config
  (setq org-capture-templates
        '(("b" "book" entry
           (file+headline "20250919T122651--book-tracker.org" "Book Agenda")
           "* TODO [#A] %? %^{Title} by %^{Author}"
           :prepend t)
          ("w" "weight" item
           (file+headline "20250919T130545--weight-tracking.org" "Weight")
           "- %t : %?")
)))

(use-package org
  :ensure nil
  :config
  (setq org-confirm-babel-evaluate nil
        org-src-window-setup 'current-window
        org-edit-src-persistent-message nil
        org-src-fontify-natively t
        org-src-preserve-indentation t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 0)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
)))

(use-package org
  :ensure nil
  :config
  (setq org-export-with-toc t)
  (setq org-export-headline-levels 8)
  (setq org-export-dispatch-use-expert-ui nil)
  (setq org-html-htmlize-output-type nil)
  (setq org-html-head-include-default-style nil)
  (setq org-html-head-include-scripts nil))

(use-package ox-reveal
  :ensure t
  :after ox
  :config
  (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js"))

(use-package htmlize
  :ensure t
  :config
  (setq org-html-htmlize-output-type 'inline-css))

(use-package org
:ensure nil
  :bind
  ( :map global-map
    ("C-c A" . org-agenda))
:config
