emacs/.emacs.d/init.org
** Org Agenda

#+begin_src emacs-lisp :tangle "init.el"

(use-package org
:ensure nil
  :bind
  ( :map global-map
    ("C-c A" . org-agenda))
:config
(setq org-default-notes-file (make-temp-file "emacs-org-notes-")) ; send it to oblivion
  (setq org-agenda-files (list org-directory))
  (setq org-agenda-span 'week)
  (setq org-agenda-start-on-weekday 1)  ; Monday
  (setq org-agenda-confirm-kill t)
  (setq org-agenda-show-all-dates t)
  (setq org-agenda-show-outline-path nil)
  (setq org-agenda-window-setup 'current-window)
  (setq org-agenda-skip-comment-trees t)
  (setq org-agenda-menu-show-matcher t)
  (setq org-agenda-menu-two-columns nil)
  (setq org-agenda-sticky nil)
  (setq org-agenda-custom-commands-contexts nil)
  (setq org-agenda-max-entries nil)
  (setq org-agenda-max-todos nil)
  (setq org-agenda-max-tags nil)
  (setq org-agenda-max-effort nil)
  (setq org-deadline-warning-days 3)

(setq org-agenda-prefix-format
        '((agenda . " %i %-12:c%?-12t% s")
          (todo . " %i %-12:c")
          (tags . " %i %-12:c")
          (search . " %i %-12:c")))
  (setq org-agenda-sorting-strategy
        '(((agenda habit-down time-up priority-down category-keep)
           (todo priority-down category-keep)
           (tags priority-down category-keep)
           (search category-keep))))
  (setq org-agenda-breadcrumbs-separator "->")
  (setq org-agenda-todo-keyword-format "%-1s")
  (setq org-agenda-fontify-priorities 'cookies)
  (setq org-agenda-category-icon-alist nil)
  (setq org-agenda-remove-times-when-in-prefix nil)
  (setq org-agenda-remove-timeranges-from-blocks nil)
  (setq org-agenda-compact-blocks nil)
  (setq org-agenda-block-separator ?—)

;;;;; Agenda marks
  (setq org-agenda-bulk-mark-char "#")
  (setq org-agenda-persistent-marks nil)

;;;;; Agenda diary entries
  (setq org-agenda-insert-diary-strategy 'date-tree)
  (setq org-agenda-insert-diary-extract-time nil)
  (setq org-agenda-include-diary nil)
  (setq diary-file (make-temp-file "emacs-diary-"))
  (setq org-agenda-diary-file 'diary-file)

;;;;; Agenda follow mode
  (setq org-agenda-start-with-follow-mode nil)
  (setq org-agenda-follow-indirect t)

;;;;; Agenda multi-item tasks
  (setq org-agenda-dim-blocked-tasks t)
  (setq org-agenda-todo-list-sublevels t)

;;;;; Agenda filters and restricted views
  (setq org-agenda-persistent-filter nil)
  (setq org-agenda-restriction-lock-highlight-subtree t)

  ;; Time grid
  (setq org-agenda-time-leading-zero t)
  (setq org-agenda-timegrid-use-ampm nil)
  (setq org-agenda-use-time-grid t)
  (setq org-agenda-show-current-time-in-grid t)
  (setq org-agenda-current-time-string (concat "Now " (make-string 70 ?.)))
  (setq org-agenda-time-grid
        '((daily today require-timed)
          ( 0500 0600 0700 0800 0900 1000
            1100 1200 1300 1400 1500 1600
            1700 1800 1900 2000 2100 2200)
          "" ""))
  (setq org-agenda-default-appointment-duration nil)

;;;;; Agenda global to-do list
  (setq org-agenda-todo-ignore-with-date t)
  (setq org-agenda-todo-ignore-timestamp t)
  (setq org-agenda-todo-ignore-scheduled t)
  (setq org-agenda-todo-ignore-deadlines t)
  (setq org-agenda-todo-ignore-time-comparison-use-seconds t)
  (setq org-agenda-tags-todo-honor-ignore-options nil)

;;;;; Agenda tagged items
  (setq org-agenda-show-inherited-tags t)
  (setq org-agenda-use-tag-inheritance
        '(todo search agenda))
  (setq org-agenda-hide-tags-regexp nil)
  (setq org-agenda-remove-tags nil)
  (setq org-agenda-tags-column 1)

;;;;; Agenda entry
  (setq org-agenda-start-with-entry-text-mode nil)
  (setq org-agenda-entry-text-maxlines 5)
  (setq org-agenda-entry-text-exclude-regexps nil)
  (setq org-agenda-entry-text-leaders "    > "))

#+end_src

**  Org Protocol

#+begin_src emacs-lisp :tangle "init.el"

(use-package org-protocol
  :ensure nil)

#+end_src

** Org Modern (disabled for now)

#+begin_src emacs-lisp :tangle "init.el"

;(use-package org-modern
;  :ensure t
;  :hook
;  (org-mode . org-modern-mode)
;  (org-agenda-finalize . org-modern-agenda))

#+end_src

* Eww (Emacs Browser)

#+begin_src emacs-lisp :tangle "init.el"

(use-package eww
  :ensure nil
  :after prot-simple
  :commands (eww)
  :bind
  ( :map eww-mode-map
    ("S" . nil)
    ("b" . prot-simple-buffers-major-mode)
    ("m" . bookmark-set)
    :map eww-link-keymap
    ("v" . nil)
    :map dired-mode-map
    ("E" . eww-open-file))
  :config
  (setq eww-auto-rename-buffer 'title)
  (setq eww-header-line-format nil)
  (setq eww-bookmarks-directory (locate-user-emacs-file "eww-bookmarks/"))
  (setq eww-history-limit 150)
  (setq eww-use-external-browser-for-content-type
        "\\`\\(video/\\|audio\\)")
  (setq eww-form-checkbox-selected-symbol "[X]")
  (setq eww-form-checkbox-symbol "[ ]")

  (setq eww-retrieve-command nil)

  (dolist (command '( eww-list-bookmarks eww-add-bookmark eww-bookmark-mode
                      eww-list-buffers eww-toggle-fonts eww-toggle-colors
                      eww-switch-to-buffer))
    (put command 'disabled t)))

(use-package eww
  :ensure nil
  :commands (eww)
  :bind
  ( :map eww-mode-map
    ("S" . nil)
    ("m" . bookmark-set)
    :map eww-link-keymap
    ("v" . nil)
    :map dired-mode-map
    ("E" . eww-open-file))
  :config
  (setq eww-auto-rename-buffer 'title)
  (setq eww-header-line-format nil)
  (setq eww-bookmarks-directory (locate-user-emacs-file "eww-bookmarks/"))
  (setq eww-history-limit 150)
  (setq eww-form-checkbox-selected-symbol "[X]")
  (setq eww-form-checkbox-symbol "[ ]"))


#+end_src

* Denote

** Main Denote Package

#+begin_src emacs-lisp :tangle "init.el"

(use-package denote
  :ensure t
  :hook
  ((dired-mode . denote-dired-mode))
  :bind
  ( :map global-map
    ("C-c n n" . denote-open-or-create)
    ("C-c n N" . denote-type)
    ("C-c n d" . denote-sort-dired)
    ("C-c n r" . denote-rename-file)
    :map text-mode-map
    ("C-c n i" . denote-link)
    ("C-c n I" . denote-add-links)
    ("C-c n b" . denote-backlinks)
    ("C-c n R" . denote-rename-file-using-front-matter)
    :map dired-mode-map
    ("C-c C-d C-i" . denote-dired-link-marked-notes)
    ("C-c C-d C-r" . denote-dired-rename-marked-files)
    ("C-c C-d C-k" . denote-dired-rename-marked-files-with-keywords)
    ("C-c C-d C-f" . denote-dired-rename-marked-files-using-front-matter))
  :config
  (setq denote-directory (expand-file-name "~/projects/private/orgs"))
  ;(setq denote-file-type 'markdown-yaml)
  (setq denote-file-type 'org)
  (setq denote-known-keywords '("business"))
  (setq denote-infer-keywords t)
  (setq denote-sort-keywords t)
  (setq denote-excluded-directories-regexp nil)
  (setq denote-date-format nil)
  (setq denote-rename-confirmations nil)
  (setq denote-backlinks-show-context nil)
  (setq denote-buffer-name-prefix "[D] ")
  (setq denote-rename-buffer-format "%D")

  (denote-rename-buffer-mode 1))

#+end_src

** denote-org (for org dynamic blocks)

#+begin_src emacs-lisp :tangle "init.el"

(use-package denote-org
  :ensure t)

#+end_src

* Vterm

#+begin_src emacs-lisp :tangle "init.el"

(use-package vterm
  :ensure t
  :commands (vterm)
  :bind
   ("C-c t" . vterm)
  :config
  (setq vterm-shell "/bin/bash"))

#+end_src

* Webjump

#+begin_src emacs-lisp :tangle "init.el"

 (use-package webjump
   :defer
   :ensure nil
   :bind
   ("C-x /" . webjump)
   :config
   (setq webjump-sites
	  '(
	    ("ChatGPT" . "https://chatgpt.com/")
	    ("GitHub" . "https://github.com/")
        ("Privacy (cards)" . "https://app.privacy.com/home")	    	    ("Amazon" . [simple-query "https://www.amazon.com/" "https://www.amazon.com/s?k=" ""])
	    ("Google" . [simple-query "www.google.com" "www.google.com/search?q=" ""])
	    ("YouTube" . [simple-query "www.youtube.com/feed/subscriptions" "www.youtube.com/results?search_query=" ""])
	    ("Reddit" . [simple-query "https://www.reddit.com" "https://www.reddit.com/search/?q=" ""])
	    ("Canvas" . "https://lrccd.instructure.com/")
	    ("Desmos Graphing Calculator" . "https://www.desmos.com/calculator")
	    ("Discord" . "https://discord.com/channels/@me")
)))

#+end_src

* Markdown

#+begin_src emacs-lisp :tangle "init.el"

(use-package markdown-mode
  :ensure t
  :mode ("\\.md\\'" . markdown-mode)
  :init
  (setq markdown-command "pandoc"))

#+end_src

* Yasnippets

#+begin_src emacs-lisp :tangle "init.el"

(use-package yasnippet
  :ensure t
  :init
  (yas-global-mode 1))

#+end_src

* Keybinds

