emacs/.emacs.d/init.org
** Evil

*** Evil Mode

#+begin_src emacs-lisp :tangle "init.el"

;; Make C-u scroll like Vim and let evil-collection own keybindings
(setq evil-want-C-u-scroll t
      evil-want-keybinding nil)

(use-package evil
  :ensure t
  :init
  ;; Optionally keep TAB for Org (so Org cycling still works)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1))

#+end_src

*** Evil Collection

#+begin_src emacs-lisp :tangle "init.el"

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))

#+end_src

*** Better Terminal Integration

#+begin_src emacs-lisp :tangle "init.el"

(dolist (m '(term-mode vterm-mode eshell-mode shell-mode))
  (add-to-list 'evil-emacs-state-modes m))

#+end_src

*** Evil Surround

#+begin_src emacs-lisp :tangle "init.el"

(use-package evil-surround
  :after evil
  :ensure t
  :config
  (global-evil-surround-mode 1))

#+end_src

*** Evil Nerd Commenter (comments)

#+begin_src emacs-lisp :tangle "init.el"

(use-package evil-nerd-commenter
  :after evil
  :ensure t
  :bind (("M-;" . evilnc-comment-or-uncomment-lines))
  :config
  (define-key evil-normal-state-map "gc" 'evilnc-comment-operator)
  (define-key evil-visual-state-map "gc" 'evilnc-comment-operator)
  (define-key evil-normal-state-map "gcc" 'evilnc-comment-or-uncomment-lines))

#+end_src

*** Evil Better Undo (undo-fu)

#+begin_src emacs-lisp :tangle "init.el"

(use-package undo-fu
  :ensure t)
(with-eval-after-load 'evil
  (setq evil-undo-system 'undo-fu))

#+end_src

** Which Key

#+begin_src emacs-lisp :tangle "init.el"

(use-package which-key
  :diminish which-key-mode
  :init
  (which-key-mode)
  (which-key-setup-minibuffer)
  :config
  (setq which-key-idle-delay 0.3)
  (setq which-key-prefix-prefix "◉ ")
  (setq which-key-sort-order 'which-key-key-order-alpha
        which-key-min-display-lines 3
        which-key-max-display-columns nil))

#+end_src

* Windows

** Tab Bar Mode

#+begin_src emacs-lisp :tangle "init.el"

(use-package tab-bar
  :ensure nil
  :config
  (setq tab-bar-new-button-show nil)
  (setq tab-bar-close-button-show nil)
  (setq tab-bar-show 1))

#+end_src

* Parenthesis

** Electric

#+begin_src emacs-lisp :tangle "init.el"

(use-package electric
  :ensure nil
  :hook
  (prog-mode . electric-indent-local-mode)
  :config
  (electric-pair-mode -1)
  (electric-quote-mode -1)
  (electric-indent-mode -1))

#+end_src

* Shell

#+begin_src emacs-lisp

(use-package shell
  :ensure nil
  :bind
  ( :map shell-mode-map
    ("C-c C-k" . comint-clear-buffer)
    ("C-c C-w" . comint-write-output))
  :config
  ;; Check my .bashrc which handles `comint-terminfo-terminal':
  ;;
  ;; # Default pager.  The check for the terminal is useful for Emacs with
  ;; # M-x shell (which is how I usually interact with bash these days).
  ;; #
  ;; # The COLORTERM is documented in (info "(emacs) General Variables").
  ;; # I found the reference to `dumb-emacs-ansi' in (info "(emacs)
  ;; # Connection Variables").
  ;; if [ "$TERM" = "dumb" ] && [ "$INSIDE_EMACS" ] || [ "$TERM" = "dumb-emacs-ansi" ] && [ "$INSIDE_EMACS" ]
  ;; then
  ;;     export PAGER="cat"
  ;;     alias less="cat"
  ;;     export TERM=dumb-emacs-ansi
  ;;     export COLORTERM=1
  ;; else
  ;;     # Quit once you try to scroll past the end of the file.
  ;;     export PAGER="less --quit-at-eof"
  ;; fi
  (setq shell-command-prompt-show-cwd t) ; Emacs 27.1
  (setq shell-input-autoexpand 'input)
  (setq shell-highlight-undef-enable t) ; Emacs 29.1
  (setq shell-has-auto-cd nil) ; Emacs 29.1
  (setq shell-get-old-input-include-continuation-lines t) ; Emacs 30.1
  (setq shell-kill-buffer-on-exit t) ; Emacs 29.1
  (setq shell-completion-fignore '("~" "#" "%"))
  (setq tramp-default-remote-shell "/bin/bash")

  (setq shell-font-lock-keywords
        '(("[ \t]\\([+-][^ \t\n]+\\)" 1 font-lock-builtin-face)
          ("^[^ \t\n]+:.*" . font-lock-string-face)
          ("^\\[[1-9][0-9]*\\]" . font-lock-constant-face))))

(use-package prot-shell
  :ensure nil
  :bind (("<f1>" . prot-shell)) ; I don't use F1 for help commands
  :hook (shell-mode . prot-shell-mode))

#+end_src


* Auto Tangle to init.el

#+begin_src emacs-lisp :tangle "init.el"

(defun efs/org-babel-tangle-config ()
  (when (string= (buffer-file-name)
                 (expand-file-name "~/projects/public/dotfiles/emacs/.emacs.d/init.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'after-save-hook #'efs/org-babel-tangle-config)

#+end_src

* Modules

