emacs/.emacs.d/init.el

;; Make C-u scroll like Vim and let evil-collection own keybindings
(setq evil-want-C-u-scroll t
      evil-want-keybinding nil)

(use-package evil
  :ensure t
  :init
  ;; Optionally keep TAB for Org (so Org cycling still works)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))

(dolist (m '(term-mode vterm-mode eshell-mode shell-mode))
  (add-to-list 'evil-emacs-state-modes m))

(use-package evil-snipe
  :ensure t
  :after evil
  :custom
  (evil-snipe-scope 'whole-visible)
  (evil-snipe-repeat-scope 'whole-visible)
  (evil-snipe-smart-case t)
  :config
  (evil-snipe-mode +1)
  (evil-snipe-override-mode +1))

(use-package evil-surround
  :after evil
  :ensure t
  :config
  (global-evil-surround-mode 1))

(use-package evil-nerd-commenter
  :after evil
  :ensure t
  :bind (("M-;" . evilnc-comment-or-uncomment-lines))
  :config
  ;; (define-key evil-normal-state-map "gc" 'evilnc-comment-operator)
  (define-key evil-visual-state-map "gc" 'evilnc-comment-operator)
  (define-key evil-normal-state-map "gcc" 'evilnc-comment-or-uncomment-lines))

(use-package undo-fu
  :ensure t)
(with-eval-after-load 'evil
  (setq evil-undo-system 'undo-fu))

(use-package which-key
  :diminish which-key-mode
  :init
  (which-key-mode)
  (which-key-setup-minibuffer)
  :config
  (setq which-key-idle-delay 0.3)
  (setq which-key-prefix-prefix "◉ ")
  (setq which-key-sort-order 'which-key-key-order-alpha
        which-key-min-display-lines 3
        which-key-max-display-columns nil))

(use-package tab-bar
  :ensure nil
  :config
  (setq tab-bar-new-button-show nil)
  (setq tab-bar-close-button-show nil)
  (setq tab-bar-show 1))

(use-package electric
  :ensure nil
  :hook
  (prog-mode . electric-indent-local-mode)
  :config
  (electric-pair-mode -1)
  (electric-quote-mode -1)
  (electric-indent-mode -1))

(defun efs/org-babel-tangle-config ()
  (when (string= (buffer-file-name)
                 (expand-file-name "~/projects/public/dotfiles/emacs/.emacs.d/init.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'after-save-hook #'efs/org-babel-tangle-config)
